{
  "title": "Gasoline Prices ",
  "description": "The Gasoline Prices dataset, sourced from the U.S. Energy Information Administration, spans 20 years from 1994 to 2023 and contains various weekly series related to gasoline and diesel prices. These series encompass different gasoline grades and formulations, along with diesel prices. The dataset is a valuable resource for analyzing and predicting fluctuations in gasoline prices over time.",
  "modelCategory": "forecasting",
  "schemaVersion": 1.0,
  "inputDataFormat": "CSV",
  "encoding": "utf-8",
  "frequency": "weekly",
  "forecastLength": 13,
  "idField": {
    "name": "SeriesId",
    "description": "Unique identifier for the series."
  },
  "timeField": {
    "name": "Date",
    "description": "Date representing the week of the data sample",
    "dataType": "DATE",
    "example": "1994-11-28"
  },
  "forecastTarget": {
    "name": "Weekly U.S. All Grades All Formulations Retail Gasoline Prices (Dollars per Gallon)",
    "description": "Target variable: Average retail prices per gallon for gasoline across all grades and formulations, reflecting the broad U.S. market.",
    "dataType": "NUMERIC",
    "example": 1.117
  },
  "pastCovariates": [
    {
      "name": "Weekly U.S. All Grades Conventional Retail Gasoline Prices (Dollars per Gallon)",
      "description": "Average weekly retail prices for conventional gasoline across all grades, excluding reformulated blends.",
      "dataType": "NUMERIC",
      "example": 1.175
    },
    {
      "name": "Weekly U.S. All Grades Reformulated Retail Gasoline Prices (Dollars per Gallon)",
      "description": "Average weekly retail prices for reformulated gasoline, which is blended to reduce pollutants, across all grades.",
      "dataType": "NUMERIC",
      "example": 1.259
    },
    {
      "name": "Weekly U.S. Regular All Formulations Retail Gasoline Prices (Dollars per Gallon)",
      "description": "Composite average of retail prices for regular gasoline, encompassing both conventional and reformulated gasoline.",
      "dataType": "NUMERIC",
      "example": 1.105
    },
    {
      "name": "Weekly U.S. Regular Conventional Retail Gasoline Prices (Dollars per Gallon)",
      "description": "Average price of regular grade conventional gasoline, not including any reformulated gasoline components.",
      "dataType": "NUMERIC",
      "example": 1.082
    },
    {
      "name": "Weekly U.S. Regular Reformulated Retail Gasoline Prices (Dollars per Gallon)",
      "description": "Weekly average price for regular grade reformulated gasoline, specifically designed to produce fewer emissions.",
      "dataType": "NUMERIC",
      "example": 1.149
    },
    {
      "name": "Weekly U.S. Midgrade All Formulations Retail Gasoline Prices (Dollars per Gallon)",
      "description": "Combined average retail prices for midgrade gasoline, including both conventional and reformulated types.",
      "dataType": "NUMERIC",
      "example": 1.197
    },
    {
      "name": "Weekly U.S. Midgrade Conventional Retail Gasoline Prices (Dollars per Gallon)",
      "description": "Average retail price for midgrade conventional gasoline, which does not include reformulated gasoline.",
      "dataType": "NUMERIC",
      "example": 1.174
    },
    {
      "name": "Weekly U.S. Midgrade Reformulated Retail Gasoline Prices (Dollars per Gallon)",
      "description": "Average weekly price of midgrade gasoline in its reformulated variant, mixed to lower environmental impact.",
      "dataType": "NUMERIC",
      "example": 1.249
    },
    {
      "name": "Weekly U.S. Premium All Formulations Retail Gasoline Prices (Dollars per Gallon)",
      "description": "Average weekly prices for premium gasoline, covering all types including both conventional and reformulated gasoline.",
      "dataType": "NUMERIC",
      "example": 1.303
    },
    {
      "name": "Weekly U.S. Premium Conventional Retail Gasoline Prices (Dollars per Gallon)",
      "description": "Weekly retail prices for premium conventional gasoline, excluding the reformulated blend.",
      "dataType": "NUMERIC",
      "example": 1.27
    },
    {
      "name": "Weekly U.S. Premium Reformulated Retail Gasoline Prices (Dollars per Gallon)",
      "description": "Average price for premium grade reformulated gasoline, which burns cleaner than conventional blends.",
      "dataType": "NUMERIC",
      "example": 1.351
    },
    {
      "name": "Weekly U.S. No 2 Diesel Retail Prices (Dollars per Gallon)",
      "description": "Average retail price per gallon of No. 2 diesel fuel, commonly used in freight and diesel-engine vehicles.",
      "dataType": "NUMERIC",
      "example": 1.126
    }
  ],
  "future_covariates": []
}